{
  "Version": "1.3",
  "ID": "f1hvlrov4m4ore6mzw6zamiqqsohl64wtv2peas3q",
  "Issue Number": "64",
  "Client": {
    "Name": "Hunan Datong Lake Farm Co., Ltd",
    "Region": "China",
    "Industry": "Resources, Agriculture & Fisheries",
    "Website": "www.datonglake.com",
    "Social Media": "www.datonglake.com",
    "Social Media Type": "Other",
    "Role": "Dataset Owner"
  },
  "Project": {
    "Brief history of your project and organization": "Hunan Datong Lake Farm Co., Ltd. is located in Datong Lake District, Yiyang City, Hunan Province. It is a modern agricultural enterprise dedicated to the development of high-tech agriculture. The company relies on the abundant water resources and fertile land resources in Datong Lake area, combined with modern agricultural technology, and is committed to building a comprehensive agricultural enterprise that integrates agricultural and sideline product planting, procurement, and sales, aquatic product procurement and sales, as well as agricultural technology promotion services.\n\nSince its establishment, the company has always adhered to the development concept of \"technology led, innovation driven\", actively introduced and applied advanced technologies such as unmanned farms, precision agriculture, and intelligent agricultural machinery, and promoted the transformation and upgrading of traditional agriculture to modern agriculture. Through deep cooperation with research institutes such as South China Agricultural University and Huazhong Agricultural University, the company has successfully built an unmanned rice farm in Datong Lake District, achieving full process data collection and analysis of rice production, intelligent decision-making of agricultural instructions, and intelligent execution of agricultural machinery operations.",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "Data collection video and agriculture, animal husbandry some learning materials, publicity, meetings, etc., mainly video-based",
    "Where was the data currently stored in this dataset sourced from": "My Own Storage Infra",
    "How do you plan to prepare the dataset": "We will use singularity to generate the car file and transfer it to the SP, then use boost for deal sending",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "https://space.bilibili.com/2043625263\n\nIt's all agriculture related videos.",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[x] I confirm",
    "What is the expected retrieval frequency for this data": "Yearly",
    "For how long do you plan to keep this dataset stored on Filecoin": "Permanently",
    "In which geographies do you plan on making storage deals": "Greater China, Asia other than Greater China, North America, South America, Europe",
    "How will you be distributing your data to storage providers": "HTTP or FTP server, Shipping hard drives",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "f03377773 Vietnam\nf03377778 Vietnam\nf03499888 foshan\nf03373733 Guangdong\nf03373337 Guangdong\nf03373373 Guangdong",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "5PiB",
    "Single Size Dataset": "500TiB",
    "Replicas": 10,
    "Weekly Allocation": "2PiB"
  },
  "Lifecycle": {
    "State": "Granted",
    "Validated At": "2025-06-08 06:36:09.596900740 UTC",
    "Validated By": "Lind111",
    "Active": true,
    "Updated At": "2025-06-08 06:36:09.596896109 UTC",
    "Active Request ID": "5b6e23de-7114-4f48-908f-2b67c893d83c",
    "On Chain Address": "f1hvlrov4m4ore6mzw6zamiqqsohl64wtv2peas3q",
    "Multisig Address": "false",
    "edited": false
  },
  "Allocation Requests": [
    {
      "ID": "1aa9254f-eb5c-405f-bd48-f1f148404c11",
      "Request Type": "First",
      "Created At": "2025-06-06 09:51:50.347119863 UTC",
      "Updated At": "2025-06-06 09:51:50.347120929 UTC",
      "Active": false,
      "Allocation Amount": "281474976710656 B",
      "Signers": [
        {
          "Github Username": "Lind111",
          "Signing Address": "f1edi46m4ry7smqnk3p6nb4azmcythf4bl57lw3uy",
          "Created At": "2025-06-06 09:53:33.173000000 UTC",
          "Message CID": "bafy2bzacedd4wzg6g2goowvtga755pvjogr5aqnv6kgzvozsqlp5ccgombgje"
        }
      ]
    },
    {
      "ID": "5b6e23de-7114-4f48-908f-2b67c893d83c",
      "Request Type": "Refill",
      "Created At": "2025-06-08 06:33:02.250846926 UTC",
      "Updated At": "2025-06-08 06:33:02.250847574 UTC",
      "Active": false,
      "Allocation Amount": "562949953421312B",
      "Signers": [
        {
          "Github Username": "Lind111",
          "Signing Address": "f1edi46m4ry7smqnk3p6nb4azmcythf4bl57lw3uy",
          "Created At": "2025-06-08 06:36:07.873000000 UTC",
          "Message CID": "bafy2bzaceboypdyioczlz4gnn56lsexekfxhua4pt4aycgqsglur42urgnjhe"
        }
      ]
    }
  ]
}