{
  "Version": "1.3",
  "ID": "f1qfm5gkrguixoy6ycf2o4obij5tkyi6pzgs2dtxy",
  "Issue Number": "24",
  "Client": {
    "Name": "Greis",
    "Region": "China",
    "Industry": "Information, Media & Telecommunications",
    "Website": "http://www.htymeta.com/",
    "Social Media": "longyue19960810@gmail.com",
    "Social Media Type": "Other",
    "Role": "Dataset Owner"
  },
  "Project": {
    "Brief history of your project and organization": "As a Hantang cloud new retail intelligent solution, Cloud Watch has strong technical strength and rich industry experience, focusing on the traditional offline merchant digitalization, unmanned upgrade and transformation of intelligent new retail platform. Through the intelligent voice intercom system, provide a combination of artificial + intelligent 7*24*365 cloud duty service. Without changing the original business model, let the retail stores complete the digital and intelligent upgrading and transformation, and achieve on-site duty during the peak period and cloud duty during the low peak period.",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "Heterogeneous GPU computing container cluster management services, cloud resource pool management services, node pool management services, providing web-based user-self-service portal.",
    "Where was the data currently stored in this dataset sourced from": "My Own Storage Infra",
    "How do you plan to prepare the dataset": "No response",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "http://www.htymeta.com/news_detail-1754.html\r\nhttp://www.htymeta.com/news_detail-1759.html",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[X] I confirm",
    "What is the expected retrieval frequency for this data": "Daily",
    "For how long do you plan to keep this dataset stored on Filecoin": "More than 3 years",
    "In which geographies do you plan on making storage deals": "Asia other than Greater China",
    "How will you be distributing your data to storage providers": "Cloud storage (i.e. S3)",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "f03178191 US\r\nf03178188 US\r\nf03178173 US\r\nf03178165 US",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "6PiB",
    "Single Size Dataset": "1PiB",
    "Replicas": 6,
    "Weekly Allocation": "500TiB"
  },
  "Lifecycle": {
    "State": "Submitted",
    "Validated At": "",
    "Validated By": "",
    "Active": true,
    "Updated At": "2024-08-27 08:46:56.836947513 UTC",
    "Active Request ID": "",
    "On Chain Address": "f1qfm5gkrguixoy6ycf2o4obij5tkyi6pzgs2dtxy",
    "Multisig Address": "false",
    "edited": false
  },
  "Allocation Requests": []
}