{
  "Version": 1,
  "ID": "f1txfwjexmp4gp3dqdglgc3i7qacnyseocs4cecky",
  "Issue Number": "9",
  "Client": {
    "Name": "Xinjiang Nongyuan Jiaye Agricultural Investment Co., Ltd",
    "Region": "China",
    "Industry": "Resources, Agriculture & Fisheries",
    "Website": "N/A",
    "Social Media": "Email:2281895919@qq.com",
    "Social Media Type": "Other",
    "Role": "Dataset Owner"
  },
  "Project": {
    "Project Id": "1",
    "Brief history of your project and organization": "Xinjiang Nongyuan Jiaye Agricultural Investment Co., Ltd. was established on July 26, 2016, and its registered address is 604, Floor 6, Jiangnan Senior Apartment, Saiwai, No. 1096, Karamay West Street, Saybag District, Ürümqi, Xinjiang. Its legal representative is Li Zhifeng. The business scope includes agricultural technology extension services, crop planting, agricultural services, Agricultural science research and experimental development, agricultural tourism, import and export of goods and technology, online trade agents, software and information technology services, Information technology consulting consulting services, vocational skills training, poultry breeding; Sales: agricultural products, livestock products, fresh aquatic products, daily necessities, vegetables and fruits; Wholesale and retail: pre packaged food and bulk food.",
    "Is this project associated with other projects/ecosystem stakeholders?": "No",
    "Describe the data being stored onto Filecoin": "Video files include displays of farmland, various plants and animals, research data and images, etc",
    "Where was the data currently stored in this dataset sourced from": "My Own Storage Infra",
    "How do you plan to prepare the dataset": "Our technical department has tested and mastered the packaging data and issued the order command, using the branch packaging data under singularity, and using the boost tool to issue the order.",
    "Please share a sample of the data (a link to a file, an image, a table, etc., are good ways to do this.)": "https://drive.google.com/drive/folders/1nDKibmicmL4-c7YCEWwACMwA_SxrtCTE?usp=drive_link\r\nhttps://drive.google.com/drive/folders/1eiaYIB4X-yG3zRZtaKElF-iLoC1VtU7j?usp=drive_link\r\nhttps://drive.google.com/drive/folders/1mqyXgA1P0dfb8r9rhli3T-lL2676SJXz?usp=drive_link\r\nhttps://drive.google.com/drive/folders/1V90RWTvFyZRA8hLshPse8mgXPNocQtm7?usp=drive_link",
    "Confirm that this is a public dataset that can be retrieved by anyone on the network (i.e., no specific permissions or access rights are required to view the data)": "[X] I confirm",
    "What is the expected retrieval frequency for this data": "Yearly",
    "For how long do you plan to keep this dataset stored on Filecoin": "More than 3 years",
    "In which geographies do you plan on making storage deals": "Greater China, Asia other than Greater China, North America, South America, Europe",
    "How will you be distributing your data to storage providers": "HTTP or FTP server, Shipping hard drives",
    "Please list the provider IDs and location of the storage providers you will be working with. Note that it is a requirement to list a minimum of 5 unique provider IDs, and that your client address will be verified against this list in the future": "f02770938 South Korea\r\nf02820008 Hong Kong\r\nf02237010 Tokyo\r\nf02093396 Singapore\r\nf02259777 Singapore\r\nf01888808 Romania",
    "Can you confirm that you will follow the Fil+ guideline (Data owner should engage at least 4 SPs and no single SP ID should receive >30% of a client's allocated DataCap)": "Yes"
  },
  "Datacap": {
    "Type": "ldn-v3",
    "Data Type": "Slingshot",
    "Total Requested Amount": "8PiB",
    "Single Size Dataset": "1.5PiB",
    "Replicas": 6,
    "Weekly Allocation": "400TiB"
  },
  "Lifecycle": {
    "State": "Granted",
    "Validated At": "2024-03-30 06:01:14.466231054 UTC",
    "Validated By": "Lind111",
    "Active": true,
    "Updated At": "2024-03-30 06:05:51.874872191 UTC",
    "Active Request ID": "7282335b-882c-4e50-b066-23b8eb8ae8a8",
    "On Chain Address": "f1txfwjexmp4gp3dqdglgc3i7qacnyseocs4cecky",
    "Multisig Address": "false"
  },
  "Allocation Requests": [
    {
      "ID": "7282335b-882c-4e50-b066-23b8eb8ae8a8",
      "Request Type": "First",
      "Created At": "2024-03-30 06:01:14.466235954 UTC",
      "Updated At": "2024-03-30 06:01:14.466236918 UTC",
      "Active": false,
      "Allocation Amount": "400TiB",
      "Signers": [
        {
          "Github Username": "Lind111",
          "Signing Address": "f1edi46m4ry7smqnk3p6nb4azmcythf4bl57lw3uy",
          "Created At": "2024-03-30 06:05:51.435000000 UTC",
          "Message CID": "bafy2bzacebyjkzwpuq63izlqufvk5gqzwzhfe5owvdpppro6tmbxcgl3ppkbc"
        }
      ]
    }
  ]
}